src/Catalogs/Scan_СостоянияАКБ/Scan_СостоянияАКБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СостоянияАКБ</name>
  <attributes>
    <name>УровеньСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиАКБ</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>EnumRef.Scan_ХарактеристикиАКБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Емкость</name>
      <type>
        <types>CatalogRef.Scan_ЕмкостиАКБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравненияЛевый</name>
      <type>
        <types>EnumRef.Scan_ВидСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛеваяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравненияПравый</name>
      <type>
        <types>EnumRef.Scan_ВидСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПраваяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СостоянияАКБ/ObjectModule.bsl
//rarus tenkam 08.09.2017 mantis 9425 +++ 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим уникальность уровня
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СостоянияАКБ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_СостоянияАКБ КАК Scan_СостоянияАКБ
		|ГДЕ
		|	Scan_СостоянияАКБ.УровеньСостояния = &УровеньСостояния
		|	И Scan_СостоянияАКБ.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("УровеньСостояния", УровеньСостояния);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Уровень состояния не уникальный! Состояние " + ВыборкаДетальныеЗаписи.Ссылка + " имеет такой же уровень.";
		Сообщение.Текст = НСтр("ru = 'Уровень состояния не уникальный! Состояние '; en = 'State level is not unique! State '") + ВыборкаДетальныеЗаписи.Ссылка + НСтр("ru = '  имеет такой же уровень.'; en = ' has the same level.'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "УровеньСостояния";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	// Проверим корректность заполнения тч
	Для Индекс = 0 по ХарактеристикиАКБ.Количество()-1 Цикл
		ТекСтрока = ХарактеристикиАКБ.Получить(Индекс);
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидСравненияЛевый) И ЗначениеЗаполнено(ТекСтрока.ЛеваяГраница) Тогда
			Сообщение = Новый СообщениеПользователю();
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			Если ТекущийЯзык()="en" тогда
				Сообщение.Текст = "Action failed";
			иначе
				Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			КонецЕсли;
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
			Сообщение.Поле = "ХарактеристикиАКБ[" + Индекс + "].ВидСравненияЛевый";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидСравненияПравый) И ЗначениеЗаполнено(ТекСтрока.ПраваяГраница) Тогда
			Сообщение = Новый СообщениеПользователю();
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			Если ТекущийЯзык()="en" тогда
				Сообщение.Текст = "Action failed";
			иначе
				Сообщение.Текст = "В строке " + Индекс + " не заполнено значение правого вида сравнения!";
			КонецЕсли;
			//rarus FominskiyAS 24.04.2019  mantis 14191 --- 
			Сообщение.Поле = "ХарактеристикиАКБ[" + Индекс + "].ВидСравненияПравый";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//rarus tenkam 08.09.2017 mantis 9425 ---
